ЛИС2/src/Catalogs/ОКТМО/ОКТМО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОКТМО</name>
  <comment>Справочник содержит общероссийский классификатор территорий муниципальных образований.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДополнительныйКоэффициент12</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКоэффициент2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСубъектаРФ</name>
    <type>
      <types>CatalogRef.РегионыРоссийскойФедерации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЭкологическойЗначимости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЭкологическойЗначимостиДляПочвы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Округ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/InformationRegisters/ЗначенияКоэффициентов/ЗначенияКоэффициентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКоэффициентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКТМО</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БассейновыйОкруг</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Catalogs/Коэффициенты/Коэффициенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коэффициенты</name>
  <comment>В справочнике содержится информация, которая совсем не изменяется или изменяется достаточно редко.</comment>
  <predefined>
    <items>
      <name>удалитьДополнительныйКоэффициент12</name>
      <description>Дополнительный коэффициент 1,2</description>
    </items>
    <items>
      <name>удалитьДополнительныйКоэффициент2</name>
      <description>Дополнительный коэффициент 2</description>
    </items>
    <items>
      <name>ДополнительныйКоэффициентК</name>
      <description>Дополнительный коэффициент К</description>
    </items>
    <items>
      <name>КоэффициентНормативаЛимит</name>
      <description>Коэфициент к нормативу платы в пределах установленного лимита</description>
    </items>
    <items>
      <name>КоэффициентНормативаЛимитВода</name>
      <description>Коэфициент к нормативу платы в пределах установленного лимита (Вода)</description>
    </items>
    <items>
      <name>КоэффициентНормативаЛимитВоздух</name>
      <description>Коэфициент к нормативу платы в пределах установленного лимита (Воздух)</description>
    </items>
    <items>
      <name>КоэффициентВзвешенныхВеществ</name>
      <description>Коэффициент для взвешенных веществ (вода)</description>
    </items>
    <items>
      <name>КоэффициентЗахороненияОтходов</name>
      <description>Коэффициент захоронения отходов на собственных площадках</description>
    </items>
    <items>
      <name>КоэффициентНормативаРазмещенияЛимит</name>
      <description>Коэффициент к нормативу платы за размещение отходов в пределах установленного лимита (отходы)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаВыбросВСВ</name>
      <description>Коэффициент к ставке платы за выброс в пределах ВСВ, (Квр)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаВыбросСверхлимит</name>
      <description>Коэффициент к ставке платы за выброс сверхлимит, (Кср)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаОтходыСверхлимит</name>
      <description>Коэффициент к ставке платы за отходы, размещенные сверх лимита, (Ксл)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаСбросВСС</name>
      <description>Коэффициент к ставке платы за сброс в пределах ВСС, (Квр)</description>
    </items>
    <items>
      <name>КоэффициентКСтавкеПлатыЗаСбросСверхлимит</name>
      <description>Коэффициент к ставке платы за сброс сверхлимит, (Кср)</description>
    </items>
    <items>
      <name>КоэффициентМестаРазмещения</name>
      <description>Коэффициент места расположения объекта размещения отходов</description>
    </items>
    <items>
      <name>КоэффициентЭкологическойЗначимостиВода</name>
      <description>Коэффициент экологической значимости (вода)</description>
    </items>
    <items>
      <name>КоэффициентЭкологическойЗначимостиВоздух</name>
      <description>Коэффициент экологической значимости (воздух)</description>
    </items>
    <items>
      <name>КоэффициентЭкологическойЗначимостиОтходы</name>
      <description>Коэффициент экологической значимости (почва)</description>
    </items>
    <items>
      <name>удалитьКоэффициентУчитывающийИнфляцию</name>
      <description>Коэффициент, учитывающий инфляцию</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ОКТМО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

	ВывестиКоэффициентыНаФорму();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.НаименованиеПолное;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьКоэффициенты();

КонецПроцедуры

&НаСервере
Процедура ВывестиКоэффициентыНаФорму()
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// Выведем действующие коэффициенты
	КоэффициентЭкологическойЗначимостиДляВоздуха 	= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДатаСеанса(),
																												Новый Структура("Коэффициент, ОКТМО",
																																Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух,
																																Объект.Ссылка)).Значение;
	КоэффициентЭкологическойЗначимостиДляПочвы 		= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДатаСеанса(),
																												  Новый Структура("Коэффициент, ОКТМО",
																																  Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы,
																																  Объект.Ссылка)).Значение;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияКоэффициентовСрезПоследних.Период,
	|	ЗначенияКоэффициентовСрезПоследних.БассейновыйОкруг,
	|	ЗначенияКоэффициентовСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияКоэффициентов.СрезПоследних(
	|			&Период,
	|			ОКТМО = &ОКТМО
	|				И Коэффициент = &Коэффициент) КАК ЗначенияКоэффициентовСрезПоследних";
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ОКТМО", Объект.Ссылка);
	Запрос.УстановитьПараметр("Коэффициент", Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода);

	КоэффициентыЭкологическойЗначимостиДляВоды.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	// НовыйНабор = РеквизитФормыВЗначение("КоэффициентыЭкологическойЗначимостиДляВоды");
	//       	
	// //КоэффициентыЭкологическойЗначимостиДляВоды.Отбор.Коэффициент.Установить(Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода);
	// НовыйНабор.Отбор.Коэффициент.Значение 		= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода;
	// НовыйНабор.Отбор.Коэффициент.Использование 	= Истина;
	//
	// //КоэффициентыЭкологическойЗначимостиДляВоды.Отбор.ОКТМО.Установить(Объект.Ссылка);
	// НовыйНабор.Отбор.ОКТМО.Значение 			= Объект.Ссылка;
	// НовыйНабор.Отбор.ОКТМО.Использование 		= Истина;
	//
	// НовыйНабор.Прочитать();
	// ЗначениеВДанныеФормы(НовыйНабор, КоэффициентыЭкологическойЗначимостиДляВоды);

КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыЭкологическойЗначимостиДляВодыПриИзменении(Элемент)

	Если ЭтаФорма.Элементы.КоэффициентыЭкологическойЗначимостиДляВоды.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.Элементы.КоэффициентыЭкологическойЗначимостиДляВоды.ТекущиеДанные.Период = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьКоэффициенты()
		
	// запишем действующие коэффициенты
	старыйКоэффициентЭкологическойЗначимостиДляВоздуха 	= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДата(),
																													  Новый Структура("Коэффициент, ОКТМО",
																																	  Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух,
																																	  Объект.Ссылка)).Значение;
	Если старыйКоэффициентЭкологическойЗначимостиДляВоздуха <> КоэффициентЭкологическойЗначимостиДляВоздуха
		 И ЗначениеЗаполнено(КоэффициентЭкологическойЗначимостиДляВоздуха) Тогда
		МенеджерЗаписи 				= РегистрыСведений.ЗначенияКоэффициентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Коэффициент 	= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух;
		МенеджерЗаписи.ОКТМО		= Объект.Ссылка;
		МенеджерЗаписи.Период 		= ТекущаяДата();
		МенеджерЗаписи.Значение		= КоэффициентЭкологическойЗначимостиДляВоздуха;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;

	старыйКоэффициентЭкологическойЗначимостиДляПочвы 	= РегистрыСведений.ЗначенияКоэффициентов.ПолучитьПоследнее(ТекущаяДата(),
																													Новый Структура("Коэффициент, ОКТМО",
																																	Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы,
																																	Объект.Ссылка)).Значение;
	Если старыйКоэффициентЭкологическойЗначимостиДляПочвы <> КоэффициентЭкологическойЗначимостиДляПочвы
		 И ЗначениеЗаполнено(КоэффициентЭкологическойЗначимостиДляПочвы) Тогда
		МенеджерЗаписи 				= РегистрыСведений.ЗначенияКоэффициентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Коэффициент 	= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы;
		МенеджерЗаписи.ОКТМО		= Объект.Ссылка;
		МенеджерЗаписи.Период 		= ТекущаяДата();
		МенеджерЗаписи.Значение		= КоэффициентЭкологическойЗначимостиДляПочвы;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ЗначенияКоэффициентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Коэффициент.Установить(Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода);
	НаборЗаписей.Отбор.ОКТМО.Установить(Объект.Ссылка);
	НаборЗаписей.Отбор.Период.Установить(НачалоДня(ТекущаяДата()));
	НаборЗаписей.Прочитать();

	НаборЗаписей.Очистить();

	Для Каждого СтрокаКоэффициентов Из КоэффициентыЭкологическойЗначимостиДляВоды Цикл

		Если НачалоДня(СтрокаКоэффициентов.Период) <> НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.Период 				= СтрокаКоэффициентов.Период;
		НоваяЗапись.Коэффициент 		= Справочники.Коэффициенты.КоэффициентЭкологическойЗначимостиВода;
		НоваяЗапись.ОКТМО 				= Объект.Ссылка;
		НоваяЗапись.БассейновыйОкруг 	= СтрокаКоэффициентов.БассейновыйОкруг;
		НоваяЗапись.Значение 			= СтрокаКоэффициентов.Значение;

	КонецЦикла;

	Если НаборЗаписей.Количество() > 0 Тогда
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоэффициентЭкологическойЗначимостиДляВоздуха(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОКТМО", Объект.Ссылка);
	ПараметрыОтбора.Вставить("Коэффициент",
							 ПредопределенноеЗначение("Справочник.Коэффициенты.КоэффициентЭкологическойЗначимостиВоздух"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОткрытьФорму("РегистрСведений.ЗначенияКоэффициентов.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоэффициентЭкологическойЗначимостиДляПочвы(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОКТМО", Объект.Ссылка);
	ПараметрыОтбора.Вставить("Коэффициент",
							 ПредопределенноеЗначение("Справочник.Коэффициенты.КоэффициентЭкологическойЗначимостиОтходы"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОткрытьФорму("РегистрСведений.ЗначенияКоэффициентов.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоэффициентЭкологическойЗначимостиДляВоды(Команда)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОКТМО", Объект.Ссылка);
	ПараметрыОтбора.Вставить("Коэффициент",
							 ПредопределенноеЗначение("Справочник.Коэффициенты.КоэффициентЭкологическойЗначимостиВода"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);

	ОткрытьФорму("РегистрСведений.ЗначенияКоэффициентов.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПовторяемостьГрадацийСкоростейВетра(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОКТМО", Объект.Ссылка);

	ОткрытьФорму("РегистрСведений.ПовторяемостьГрадацийСкоростейВетра.Форма.ФормаОКТМО",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСреднемесячныеТемпературыВоздуха(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОКТМО", Объект.Ссылка);

	ОткрытьФорму("РегистрСведений.СреднемесячныеТемпературыВоздуха.Форма.ФормаОКТМО",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

#КонецОбласти
